app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("username", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Murilo"], ["body", "First comment, very nice post!"], ["post_id", 1], ["created_at", "2020-04-30 14:14:40.495158"], ["updated_at", "2020-04-30 14:14:40.495158"]]