app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "This is post one"], ["updated_at", "2020-04-30 13:52:55.049801"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)